# IFC_DefPsetAddMember

## Description
Adds a new member to the currently defined Custom Object Preset.

```pascal
FUNCTION IFC_DefPsetAddMember(
				psetName : STRING;
				propName : STRING;
				propType : STRING): BOOLEAN;
```

```python
def vs.IFC_DefPsetAddMember(psetName, propName, propType):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|psetName|STRING|The Custom Property Set Name.|
|propName|STRING|Member Name.|
|propType|STRING|Member type.|

## Remarks
The possible values for the member type are 'IfcReal', 'IfcInteger', 'IfcText', 'IfcBoolean'.

## Examples
#### VectorScript ####
```pascal
PROCEDURE PsetAddMember;
VAR
        bOK : BOOLEAN
BEGIN
        {We suggest that 'Chair Details' is a Custom Pset and we want to add 'Height' member with type 'IfcReal'}
	bOK := IFC_DefPsetAddMember( 'Chair Details', 'Height', 'IfcReal');
END;

RUN(PsetAddMember);
```
#### Python ####
```python
# We suggest that 'Chair Details' is a Custom Pset and we want to add 'Height' member with type 'IfcReal'
ok = vs.IFC_DefPsetAddMember( 'Chair Details', 'Height', 'IfcReal');
```

```pascal
resultOK := IFC_DefPsetAddMember('Example', 'Example', 'Example');
```
```python
import vs

# Adds a new member to the currently defined Custom Object Preset.
psetName = 'Example'
propName = 'Example'
propType = 'Example'

ok = vs.IFC_DefPsetAddMember(psetName, propName, propType)
if ok:
    vs.Message('IFC_DefPsetAddMember succeeded')
else:
    vs.Message('IFC_DefPsetAddMember failed')
```

## See Also
IFC_DefPsetBegin
IFC_DefPsetEnd

IFC_DefPsetImport

## Version
Availability: from Vectorworks 2016.

## Category
* IFC